tylertms/dspic33e-sim/tests/device/dspic33ep_mu/timing/timer_test.c
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#include "device/dspic33ep_mu/device.h"
#include "dspic33.h"
#include "test.h"

enum { TIMER_DMA_WRITE_PAD = 0x0298u, RESET_OPCODE = 0xfe0000u };

static const uint16_t timer_registers[DSPIC33_TIMER_COUNT] = {
    0x0100u, 0x0106u, 0x010au, 0x0114u, 0x0118u, 0x0122u, 0x0126u, 0x0130u, 0x0134u};
static const uint16_t timer_periods[DSPIC33_TIMER_COUNT] = {
    0x0102u, 0x010cu, 0x010eu, 0x011au, 0x011cu, 0x0128u, 0x012au, 0x0136u, 0x0138u};
static const uint16_t timer_controls[DSPIC33_TIMER_COUNT] = {
    0x0104u, 0x0110u, 0x0112u, 0x011eu, 0x0120u, 0x012cu, 0x012eu, 0x013au, 0x013cu};
static const uint16_t timer_holding_registers[4] = {0x0108u, 0x0116u, 0x0124u, 0x0132u};
static const uint16_t timer_masks[DSPIC33_TIMER_COUNT] = {
    0xa076u, 0xa07au, 0xa072u, 0xa07au, 0xa072u, 0xa07au, 0xa072u, 0xa07au, 0xa072u};
static const uint8_t timer_irqs[DSPIC33_TIMER_COUNT] = {3u, 7u, 8u, 27u, 28u, 47u, 48u, 51u, 52u};

static uint16_t stored_word(const Dspic33* cpu, uint16_t address) {
    return (uint16_t)(cpu->data[address] | ((uint16_t)cpu->data[address + 1u] << 8u));
}

static bool interrupt_flag(Dspic33* cpu, uint8_t timer) {
    uint8_t irq = timer_irqs[timer];
    return (dspic33_read_word(cpu, (uint16_t)(0x0800u + (irq / 16u) * 2u)) &
            (uint16_t)(1u << (irq % 16u))) != 0u;
}

static void clear_interrupt(Dspic33* cpu, uint8_t timer) {
    uint8_t irq = timer_irqs[timer];
    uint16_t address = (uint16_t)(0x0800u + (irq / 16u) * 2u);
    uint16_t bit = (uint16_t)(1u << (irq % 16u));
    dspic33_write_word(cpu, address, (uint16_t)(dspic33_read_word(cpu, address) & ~bit));
}

static void configure_16_bit(Dspic33* cpu, uint8_t timer, uint16_t counter, uint16_t period,
                             uint16_t control) {
    dspic33_write_word(cpu, timer_controls[timer], 0u);
    dspic33_write_word(cpu, timer_registers[timer], counter);
    dspic33_write_word(cpu, timer_periods[timer], period);
    clear_interrupt(cpu, timer);
    dspic33_write_word(cpu, timer_controls[timer], (uint16_t)(control | 0x8000u));
}

static void configure_dma(Dspic33* cpu, uint8_t request, uint16_t source, uint16_t destination) {
    dspic33_write_word(cpu, 0x0b00u, 0u);
    dspic33_write_word(cpu, 0x0b02u, request);
    dspic33_write_word(cpu, 0x0b04u, source);
    dspic33_write_word(cpu, 0x0b06u, 0u);
    dspic33_write_word(cpu, 0x0b0cu, destination);
    dspic33_write_word(cpu, 0x0b0eu, 0u);
    dspic33_write_word(cpu, 0x0b00u, 0xa001u);
}

static void register_cases(TestState* state, Dspic33* cpu) {
    uint8_t timer;
    uint8_t pair;
    dspic33_reset(cpu, 0u);
    for (timer = 0u; timer < DSPIC33_TIMER_COUNT; timer++) {
        expect(state, dspic33_read_word(cpu, timer_periods[timer]) == 0xffffu, "period reset");
        expect(state, dspic33_read_word(cpu, timer_controls[timer]) == 0u, "control reset");
        dspic33_write_word(cpu, timer_controls[timer], 0xffffu);
        expect(state, dspic33_read_word(cpu, timer_controls[timer]) == timer_masks[timer],
               "control mask");
        dspic33_write_word(cpu, timer_controls[timer], 0u);
        dspic33_write_word(cpu, timer_registers[timer], 0x5aa5u);
        dspic33_write_word(cpu, timer_periods[timer], 0xa55au);
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 0x5aa5u,
               "counter read write");
        expect(state, dspic33_read_word(cpu, timer_periods[timer]) == 0xa55au, "period read write");
    }
    for (pair = 0u; pair < 4u; pair++) {
        dspic33_write_word(cpu, timer_holding_registers[pair], 0xa500u + pair);
        expect(state,
               dspic33_read_word(cpu, timer_holding_registers[pair]) == (uint16_t)(0xa500u + pair),
               "holding register read write");
    }
}

static void internal_counting_cases(TestState* state, Dspic33* cpu) {
    uint8_t timer;
    for (timer = 0u; timer < DSPIC33_TIMER_COUNT; timer++) {
        dspic33_reset(cpu, 0u);
        configure_16_bit(cpu, timer, 0u, 9u, 0u);
        expect(state, dspic33_device_advance(cpu, 8u), "advance before match");
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 8u, "counter before match");
        expect(state, !interrupt_flag(cpu, timer), "no early interrupt");
        expect(state, dspic33_device_advance(cpu, 1u), "advance to match");
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 9u, "counter holds period");
        expect(state, !interrupt_flag(cpu, timer), "interrupt delayed after match");
        expect(state, dspic33_device_advance(cpu, 1u), "advance after match");
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 0u,
               "counter resets after match");
        expect(state, interrupt_flag(cpu, timer), "period interrupt");
        clear_interrupt(cpu, timer);
        expect(state, dspic33_device_advance(cpu, 25u), "advance multiple periods");
        expect(state, interrupt_flag(cpu, timer),
               "multiple period advance observes elapsed interrupt delay");
        expect(state, dspic33_device_advance(cpu, 1u), "advance after multiple periods");
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 6u,
               "multiple period remainder");
        expect(state, interrupt_flag(cpu, timer), "multiple period interrupt");
    }
}

static void prescaler_cases(TestState* state, Dspic33* cpu) {
    static const uint16_t controls[4] = {0x0000u, 0x0010u, 0x0020u, 0x0030u};
    static const uint16_t divisors[4] = {1u, 8u, 64u, 256u};
    uint8_t timer;
    uint8_t prescaler;
    for (timer = 0u; timer < DSPIC33_TIMER_COUNT; timer++) {
        for (prescaler = 0u; prescaler < 4u; prescaler++) {
            dspic33_reset(cpu, 0u);
            configure_16_bit(cpu, timer, 0u, 0xffffu, controls[prescaler]);
            expect(state, dspic33_device_advance(cpu, divisors[prescaler] - 1u),
                   "advance within prescaler");
            expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 0u,
                   "prescaler retains fraction");
            expect(state, dspic33_device_advance(cpu, 1u), "advance prescaler edge");
            expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 1u,
                   "prescaler increments counter");
        }
    }
}

