tylertms/dspic33e-sim/tests/device/dspic33ep_mu/timing/timer_test.c
static void boundary_cases(TestState* state, Dspic33* cpu) {
    uint8_t timer;
    for (timer = 0u; timer < DSPIC33_TIMER_COUNT; timer++) {
        dspic33_reset(cpu, 0u);
        configure_16_bit(cpu, timer, 0u, 0u, 0u);
        expect(state, dspic33_device_advance(cpu, 1000u), "advance zero period");
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 0u,
               "zero period holds zero");
        expect(state, !interrupt_flag(cpu, timer), "zero period suppresses interrupt");

        configure_16_bit(cpu, timer, 0xfffeu, 3u, 0u);
        expect(state, dspic33_device_advance(cpu, 5u), "advance counter above period");
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 3u,
               "counter wraps before lower period match");
        expect(state, !interrupt_flag(cpu, timer), "lower period match delayed");
        expect(state, dspic33_device_advance(cpu, 1u), "reset lower period");
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 0u,
               "lower period resets after match");
        expect(state, interrupt_flag(cpu, timer), "lower period interrupt");

        configure_16_bit(cpu, timer, 0xfffeu, 0xffffu, 0u);
        expect(state, dspic33_device_advance(cpu, 1u), "match maximum period");
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 0xffffu,
               "maximum period holds at match");
        expect(state, !interrupt_flag(cpu, timer), "maximum period interrupt delayed");
        expect(state, dspic33_device_advance(cpu, 1u), "advance maximum period");
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 0u,
               "maximum period resets");
        expect(state, interrupt_flag(cpu, timer), "maximum period interrupt");
    }
}

static void interrupt_delay_cases(TestState* state, Dspic33* cpu) {
    uint8_t timer;
    for (timer = 0u; timer < DSPIC33_TIMER_COUNT; timer++) {
        dspic33_reset(cpu, 0u);
        configure_16_bit(cpu, timer, 0u, 10u, 0u);
        expect(state, dspic33_device_advance(cpu, 10u), "advance timer to period match");
        expect(state, !interrupt_flag(cpu, timer), "timer interrupt remains clear at period match");
        expect(state, dspic33_device_advance(cpu, 1u), "advance timer interrupt instruction delay");
        expect(state, interrupt_flag(cpu, timer),
               "timer interrupt sets one instruction cycle after match");

        dspic33_reset(cpu, 0u);
        configure_16_bit(cpu, timer, 0u, 2u, 0u);
        expect(state, dspic33_device_advance(cpu, 8u),
               "batch advance timer across repeated periods");
        expect(state, interrupt_flag(cpu, timer),
               "batch advance observes elapsed timer interrupt delay");
    }

    dspic33_reset(cpu, 0u);
    configure_16_bit(cpu, 0u, 0u, 1u, 0u);
    cpu->device_cycles = UINT64_MAX;
    expect(state, !dspic33_device_advance(cpu, 1u),
           "timer interrupt deadline overflow stops advance");
    expect(state, !interrupt_flag(cpu, 0u) && cpu->events.count == 0u,
           "timer deadline failure cannot raise an early interrupt");
}

static void prescaler_reset_cases(TestState* state, Dspic33* cpu) {
    uint8_t timer;
    for (timer = 0u; timer < DSPIC33_TIMER_COUNT; timer++) {
        dspic33_reset(cpu, 0u);
        configure_16_bit(cpu, timer, 0u, 100u, 0x0010u);
        dspic33_device_advance(cpu, 7u);
        dspic33_write_word(cpu, timer_controls[timer], 0x8010u);
        dspic33_device_advance(cpu, 1u);
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 0u,
               "control write clears prescaler");
        dspic33_device_advance(cpu, 7u);
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 1u,
               "control reset prescaler completes");
        dspic33_device_advance(cpu, 7u);
        dspic33_write_word(cpu, timer_registers[timer], 5u);
        dspic33_device_advance(cpu, 1u);
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 5u,
               "counter write clears prescaler");
    }
}

static void gate_cases(TestState* state, Dspic33* cpu) {
    uint8_t timer;
    for (timer = 0u; timer < DSPIC33_TIMER_COUNT; timer++) {
        dspic33_reset(cpu, 0u);
        configure_16_bit(cpu, timer, 0u, 100u, 0x0040u);
        expect(state, dspic33_device_advance(cpu, 5u), "advance closed gate");
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 0u,
               "closed gate stops timer");
        expect(state, dspic33_timer_gate(cpu, timer, true, 0u), "queue open gate");
        expect(state, dspic33_device_advance(cpu, 0u), "open gate");
        expect(state, dspic33_device_advance(cpu, 5u), "advance open gate");
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 5u, "open gate counts");
        expect(state, !interrupt_flag(cpu, timer), "open gate no interrupt");
        expect(state, dspic33_timer_gate(cpu, timer, false, 0u), "queue close gate");
        expect(state, dspic33_device_advance(cpu, 0u), "close gate");
        expect(state, interrupt_flag(cpu, timer), "falling gate interrupt");

        dspic33_reset(cpu, 0u);
        configure_16_bit(cpu, timer, 0u, 2u, 0x0040u);
        dspic33_timer_gate(cpu, timer, true, 0u);
        dspic33_device_advance(cpu, 0u);
        dspic33_device_advance(cpu, 3u);
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 0u,
               "gated timer resets after period");
        expect(state, !interrupt_flag(cpu, timer), "gated period does not raise interrupt");
        dspic33_timer_gate(cpu, timer, false, 0u);
        dspic33_device_advance(cpu, 0u);
        expect(state, interrupt_flag(cpu, timer),
               "gated falling edge raises interrupt after period");
    }
}

static void external_clock_cases(TestState* state, Dspic33* cpu) {
    uint8_t timer;
    for (timer = 0u; timer < DSPIC33_TIMER_COUNT; timer++) {
        uint16_t expected_first = (timer == 0u || (timer & 1u) != 0u) ? 0u : 1u;
        uint32_t pulses_to_match = expected_first == 0u ? 3u : 2u;
        dspic33_reset(cpu, 0u);
        configure_16_bit(cpu, timer, 0u, 2u, 0x0002u);
        expect(state, dspic33_timer_pulse(cpu, timer, 1u, 0u), "queue first external edge");
        expect(state, dspic33_device_advance(cpu, 0u), "apply first external edge");
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == expected_first,
               "external first edge behavior");
        dspic33_reset(cpu, 0u);
        configure_16_bit(cpu, timer, 0u, 2u, 0x0002u);
        expect(state, dspic33_timer_pulse(cpu, timer, pulses_to_match, 0u),
               "queue external match edges");
        expect(state, dspic33_device_advance(cpu, 0u), "apply external match edges");
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 2u,
               "external counter reaches period");
        expect(state, !interrupt_flag(cpu, timer), "external match interrupt delayed");
        expect(state, dspic33_timer_pulse(cpu, timer, 1u, 0u), "queue external reset edge");
        expect(state, dspic33_device_advance(cpu, 0u), "apply external reset edge");
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 0u,
               "external counter resets");
        expect(state, !interrupt_flag(cpu, timer),
               "external interrupt waits for instruction cycle");
        expect(state, dspic33_device_advance(cpu, 1u), "advance external interrupt delay");
        expect(state, interrupt_flag(cpu, timer), "external period interrupt");

        dspic33_reset(cpu, 0u);
        configure_16_bit(cpu, timer, 0u, 100u, 0x0042u);
        dspic33_timer_pulse(cpu, timer, 4u, 0u);
        dspic33_device_advance(cpu, 0u);
        expect(state,
               dspic33_read_word(cpu, timer_registers[timer]) == (uint16_t)(expected_first + 3u),
               "counter mode ignores gate selection");
    }
}

static void delayed_event_cases(TestState* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_16_bit(cpu, 2u, 0u, 100u, 0x0002u);
    expect(state, dspic33_timer_pulse(cpu, 2u, 4u, 5u), "queue delayed pulses");
    expect(state, dspic33_device_advance(cpu, 4u), "advance before delayed pulses");
    expect(state, dspic33_read_word(cpu, timer_registers[2]) == 0u, "delayed pulses remain queued");
    expect(state, dspic33_device_advance(cpu, 1u), "advance to delayed pulses");
    expect(state, dspic33_read_word(cpu, timer_registers[2]) == 4u, "delayed pulses apply");

    dspic33_reset(cpu, 0u);
    configure_16_bit(cpu, 0u, 0u, 100u, 0x0040u);
    expect(state, dspic33_timer_gate(cpu, 0u, true, 3u), "queue delayed gate");
    dspic33_device_advance(cpu, 2u);
    expect(state, dspic33_read_word(cpu, timer_registers[0]) == 0u, "delayed gate stays closed");
    dspic33_device_advance(cpu, 1u);
    dspic33_device_advance(cpu, 2u);
    expect(state, dspic33_read_word(cpu, timer_registers[0]) == 2u, "delayed gate opens");
}

static void pps_input_cases(TestState* state, Dspic33* cpu) {
    uint8_t timer;
    for (timer = 1u; timer < DSPIC33_TIMER_COUNT; timer++) {
        uint16_t mapping_address = (uint16_t)(0x06a6u + ((timer - 1u) / 2u) * 2u);
        uint8_t shift = (timer & 1u) != 0u ? 0u : 8u;
        uint16_t selection = (uint16_t)(64u << shift);
        uint16_t first_count = (timer & 1u) == 0u ? 1u : 0u;
        uint16_t second_count = (uint16_t)(first_count + 1u);
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x0e3eu, 0u);
        dspic33_gpio_drive(cpu, 3u, 0u, 1u);
        dspic33_write_word(cpu, mapping_address, selection);
        configure_16_bit(cpu, timer, 0u, 100u, 0x0002u);
        expect(state, dspic33_gpio_drive(cpu, 3u, 1u, 1u), "drive timer PPS input high");
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == first_count,
               "timer PPS first-edge rule follows timer type");
        expect(state, dspic33_gpio_drive(cpu, 3u, 0u, 1u), "drive timer PPS input low");
        expect(state, dspic33_gpio_drive(cpu, 3u, 1u, 1u), "drive second timer PPS edge");
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == second_count,
               "timer PPS rising edge counts");
        expect(state, dspic33_gpio_drive(cpu, 3u, 1u, 1u), "repeat stable timer PPS level");
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == second_count,
               "stable timer PPS level does not recount");

        dspic33_write_word(cpu, mapping_address, 0u);
        dspic33_gpio_drive(cpu, 3u, 0u, 1u);
        dspic33_gpio_drive(cpu, 3u, 1u, 1u);
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == second_count,
               "PPS VSS selection suppresses timer edges");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x0e3eu, 0u);
        dspic33_gpio_drive(cpu, 3u, 0u, 1u);
        dspic33_write_word(cpu, 0x0e30u, 0u);
        dspic33_write_word(cpu, mapping_address, selection);
        configure_16_bit(cpu, timer, 0u, 100u, 0x0002u);
        dspic33_gpio_drive(cpu, 3u, 0u, 1u);
        dspic33_gpio_drive(cpu, 3u, 1u, 1u);
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 0u,
               "timer PPS output pin is not a digital input");

        dspic33_reset(cpu, 0u);
        dspic33_gpio_drive(cpu, 4u, 0u, 1u);
        dspic33_write_word(cpu, 0x0e40u, 1u);
        dspic33_write_word(cpu, 0x0e4eu, 1u);
        dspic33_write_word(cpu, mapping_address, (uint16_t)(80u << shift));
        configure_16_bit(cpu, timer, 0u, 100u, 0x0002u);
        dspic33_gpio_drive(cpu, 4u, 0u, 1u);
        dspic33_gpio_drive(cpu, 4u, 1u, 1u);
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 0u,
               "analog timer PPS pin suppresses edges");
        dspic33_write_word(cpu, 0x0e4eu, 0u);
        dspic33_gpio_drive(cpu, 4u, 0u, 1u);
        dspic33_gpio_drive(cpu, 4u, 1u, 1u);
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == first_count,
               "digital timer PPS input resumes");
    }

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_gpio_drive(cpu, 3u, 0u, 1u);
    dspic33_write_word(cpu, 0x06a6u, 64u);
    configure_16_bit(cpu, 1u, 0u, 100u, 0x0040u);
    dspic33_gpio_drive(cpu, 3u, 1u, 1u);
    dspic33_device_advance(cpu, 5u);
    expect(state, dspic33_read_word(cpu, timer_registers[1]) == 5u, "timer PPS gate high counts");
    dspic33_gpio_drive(cpu, 3u, 0u, 1u);
    expect(state, interrupt_flag(cpu, 1u), "timer PPS falling gate raises interrupt");
    dspic33_device_advance(cpu, 5u);
    expect(state, dspic33_read_word(cpu, timer_registers[1]) == 5u,
           "timer PPS gate low stops counting");
}

static void timer1_pin_cases(TestState* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e2eu, 0x4000u);
    dspic33_gpio_drive(cpu, 2u, 0u, 0x4000u);
    configure_16_bit(cpu, 0u, 0u, 100u, 0x0002u);
    expect(state, dspic33_gpio_drive(cpu, 2u, 0x4000u, 0x4000u), "drive fixed Timer1 input high");
    expect(state, dspic33_read_word(cpu, timer_registers[0]) == 0u,
           "fixed Timer1 first edge synchronizes");
    dspic33_gpio_drive(cpu, 2u, 0u, 0x4000u);
    dspic33_gpio_drive(cpu, 2u, 0x4000u, 0x4000u);
    expect(state, dspic33_read_word(cpu, timer_registers[0]) == 1u,
           "fixed Timer1 second edge counts");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e2eu, 0u);
    dspic33_gpio_drive(cpu, 2u, 0u, 0x4000u);
    configure_16_bit(cpu, 0u, 0u, 100u, 0x0002u);
    dspic33_gpio_drive(cpu, 2u, 0x4000u, 0x4000u);
    expect(state, dspic33_read_word(cpu, timer_registers[0]) == 0u,
           "RPI Timer1 input suppresses edges with ANS clear");
    dspic33_write_word(cpu, 0x0e2eu, 0x4000u);
    dspic33_gpio_drive(cpu, 2u, 0u, 0x4000u);
    dspic33_gpio_drive(cpu, 2u, 0x4000u, 0x4000u);
    expect(state, dspic33_read_word(cpu, timer_registers[0]) == 0u,
           "RPI Timer1 input resumes with ANS set at synchronization edge");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e2eu, 0x4000u);
    dspic33_gpio_drive(cpu, 2u, 0u, 0x4000u);
    configure_16_bit(cpu, 0u, 0u, 100u, 0x0040u);
    dspic33_gpio_drive(cpu, 2u, 0x4000u, 0x4000u);
    dspic33_device_advance(cpu, 3u);
    expect(state, dspic33_read_word(cpu, timer_registers[0]) == 3u,
           "fixed Timer1 gate high counts");
    dspic33_gpio_drive(cpu, 2u, 0u, 0x4000u);
    expect(state, interrupt_flag(cpu, 0u), "fixed Timer1 falling gate interrupts");
}

static void pps_event_cases(TestState* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_write_word(cpu, 0x06a6u, 64u);
    configure_16_bit(cpu, 1u, 0u, 100u, 0x0002u);
    expect(state,
           dspic33_input_capture_pin(cpu, 64u, false, 0u) && dspic33_device_advance(cpu, 0u) &&
               dspic33_input_capture_pin(cpu, 64u, true, 0u) && dspic33_device_advance(cpu, 1u),
           "PPS event API drives first Timer2 edge");
    expect(state, dspic33_read_word(cpu, timer_registers[1]) == 0u,
           "PPS event API follows Type B synchronization");
    expect(state,
           dspic33_input_capture_pin(cpu, 64u, false, 0u) && dspic33_device_advance(cpu, 0u) &&
               dspic33_input_capture_pin(cpu, 64u, true, 0u) && dspic33_device_advance(cpu, 1u),
           "PPS event API drives second Timer2 edge");
    expect(state, dspic33_read_word(cpu, timer_registers[1]) == 1u,
           "PPS event API clocks mapped timer");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e2eu, 0u);
    configure_16_bit(cpu, 0u, 0u, 100u, 0x0002u);
    expect(state,
           dspic33_input_capture_pin(cpu, 62u, false, 0u) && dspic33_device_advance(cpu, 0u) &&
               dspic33_input_capture_pin(cpu, 62u, true, 0u) && dspic33_device_advance(cpu, 1u),
           "PPS event API drives fixed Timer1 edge");
    expect(state, dspic33_read_word(cpu, timer_registers[0]) == 0u,
           "fixed Timer1 event follows synchronization rule");
}

static void paired_timer_cases(TestState* state, Dspic33* cpu) {
    uint8_t low;
    for (low = 1u; low < DSPIC33_TIMER_COUNT; low += 2u) {
        uint8_t high = (uint8_t)(low + 1u);
        uint16_t holding = timer_holding_registers[low / 2u];
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, timer_controls[low], 0x0008u);
        dspic33_write_word(cpu, holding, 0x1234u);
        dspic33_write_word(cpu, timer_registers[low], 0xabcdu);
        expect(state, dspic33_read_word(cpu, timer_registers[high]) == 0x1234u,
               "paired low write transfers holding register");
        dspic33_write_word(cpu, timer_registers[high], 0x5678u);
        expect(state, dspic33_read_word(cpu, timer_registers[low]) == 0xabcdu,
               "paired low read returns low word");
        expect(state, dspic33_read_word(cpu, holding) == 0x5678u,
               "paired low read latches high word");

