tylertms/dspic33e-sim/tests/device/dspic33ep_mu/timing/timer_test.c
        dspic33_write_word(cpu, holding, 0u);
        dspic33_write_word(cpu, timer_registers[low], 0xfffeu);
        dspic33_write_word(cpu, timer_periods[low], 3u);
        dspic33_write_word(cpu, timer_periods[high], 1u);
        clear_interrupt(cpu, low);
        clear_interrupt(cpu, high);
        dspic33_write_word(cpu, timer_controls[low], 0x8008u);
        expect(state, dspic33_device_advance(cpu, 2u), "advance paired counter");
        expect(state, dspic33_read_word(cpu, timer_registers[low]) == 0u,
               "paired low counter overflow");
        expect(state, dspic33_read_word(cpu, timer_registers[high]) == 1u,
               "paired high counter increments");
        expect(state, !interrupt_flag(cpu, low) && !interrupt_flag(cpu, high),
               "paired counter no early interrupt");

        dspic33_write_word(cpu, holding, 0u);
        dspic33_write_word(cpu, timer_registers[low], 0u);
        dspic33_write_word(cpu, timer_periods[low], 2u);
        dspic33_write_word(cpu, timer_periods[high], 0u);
        clear_interrupt(cpu, low);
        clear_interrupt(cpu, high);
        expect(state, dspic33_device_advance(cpu, 2u), "advance paired to match");
        expect(state, dspic33_read_word(cpu, timer_registers[low]) == 2u,
               "paired counter holds period");
        expect(state, !interrupt_flag(cpu, high), "paired interrupt delayed");
        expect(state, dspic33_device_advance(cpu, 1u), "advance paired after match");
        expect(state, dspic33_read_word(cpu, timer_registers[low]) == 0u, "paired counter resets");
        expect(state, !interrupt_flag(cpu, low) && interrupt_flag(cpu, high),
               "paired counter uses high interrupt");

        dspic33_write_word(cpu, timer_controls[high], 0x8000u);
        dspic33_write_word(cpu, timer_registers[high], 0u);
        dspic33_device_advance(cpu, 1u);
        expect(state, dspic33_read_word(cpu, timer_registers[high]) == 0u,
               "paired mode ignores high timer control");
    }
}

static void paired_mode_cases(TestState* state, Dspic33* cpu) {
    uint8_t low;
    for (low = 1u; low < DSPIC33_TIMER_COUNT; low += 2u) {
        uint8_t high = (uint8_t)(low + 1u);
        uint16_t holding = timer_holding_registers[low / 2u];
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, timer_periods[low], 100u);
        dspic33_write_word(cpu, timer_periods[high], 0u);
        dspic33_write_word(cpu, timer_controls[low], 0x8008u | 0x0030u);
        dspic33_device_advance(cpu, 255u);
        expect(state, dspic33_read_word(cpu, timer_registers[low]) == 0u,
               "paired prescaler retains fraction");
        dspic33_device_advance(cpu, 1u);
        expect(state, dspic33_read_word(cpu, timer_registers[low]) == 1u,
               "paired prescaler increments");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, timer_periods[low], 2u);
        dspic33_write_word(cpu, timer_periods[high], 0u);
        dspic33_write_word(cpu, timer_controls[low], 0x800au);
        dspic33_timer_pulse(cpu, low, 3u, 0u);
        dspic33_device_advance(cpu, 0u);
        expect(state, dspic33_read_word(cpu, timer_registers[low]) == 2u,
               "paired external counter reaches period");
        expect(state, !interrupt_flag(cpu, high), "paired external interrupt delayed");
        dspic33_timer_pulse(cpu, low, 1u, 0u);
        dspic33_device_advance(cpu, 0u);
        expect(state, dspic33_read_word(cpu, timer_registers[low]) == 0u,
               "paired external counter resets");
        expect(state, !interrupt_flag(cpu, high),
               "paired external interrupt waits for instruction cycle");
        dspic33_device_advance(cpu, 1u);
        expect(state, interrupt_flag(cpu, high), "paired external counter uses high interrupt");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, timer_periods[low], 100u);
        dspic33_write_word(cpu, timer_periods[high], 0u);
        dspic33_write_word(cpu, timer_controls[low], 0x8048u);
        dspic33_device_advance(cpu, 5u);
        expect(state, dspic33_read_word(cpu, timer_registers[low]) == 0u,
               "paired closed gate stops counter");
        dspic33_timer_gate(cpu, low, true, 0u);
        dspic33_device_advance(cpu, 0u);
        dspic33_device_advance(cpu, 5u);
        expect(state, dspic33_read_word(cpu, timer_registers[low]) == 5u,
               "paired open gate counts");
        dspic33_timer_gate(cpu, low, false, 0u);
        dspic33_device_advance(cpu, 0u);
        expect(state, interrupt_flag(cpu, high), "paired falling gate uses high interrupt");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, timer_periods[low], 0u);
        dspic33_write_word(cpu, timer_periods[high], 0u);
        dspic33_write_word(cpu, holding, 0u);
        dspic33_write_word(cpu, timer_registers[low], 0u);
        dspic33_write_word(cpu, timer_controls[low], 0x8008u);
        dspic33_device_advance(cpu, 100u);
        expect(state,
               dspic33_read_word(cpu, timer_registers[low]) == 0u &&
                   dspic33_read_word(cpu, timer_registers[high]) == 0u,
               "paired zero period holds zero");
        expect(state, !interrupt_flag(cpu, high), "paired zero period suppresses interrupt");
    }
}

static void power_mode_cases(TestState* state, Dspic33* cpu) {
    uint8_t timer;
    for (timer = 0u; timer < DSPIC33_TIMER_COUNT; timer++) {
        dspic33_reset(cpu, 0u);
        configure_16_bit(cpu, timer, 0u, 100u, 0u);
        cpu->power_state = DSPIC33_POWER_IDLE;
        dspic33_device_advance(cpu, 3u);
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 3u, "timer runs in idle");

        dspic33_reset(cpu, 0u);
        configure_16_bit(cpu, timer, 0u, 100u, 0x2000u);
        cpu->power_state = DSPIC33_POWER_IDLE;
        dspic33_device_advance(cpu, 3u);
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 0u, "timer stops in idle");

        dspic33_reset(cpu, 0u);
        configure_16_bit(cpu, timer, 0u, 100u, 0u);
        cpu->power_state = DSPIC33_POWER_SLEEP;
        dspic33_device_advance(cpu, 3u);
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 0u,
               "internal timer stops in sleep");
    }

    dspic33_reset(cpu, 0u);
    configure_16_bit(cpu, 0u, 0u, 100u, 0x0002u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    dspic33_timer_pulse(cpu, 0u, 2u, 0u);
    dspic33_device_advance(cpu, 0u);
    expect(state, dspic33_read_word(cpu, timer_registers[0]) == 1u,
           "asynchronous Timer1 runs in sleep");

    dspic33_reset(cpu, 0u);
    configure_16_bit(cpu, 0u, 0u, 100u, 0x0006u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    dspic33_timer_pulse(cpu, 0u, 2u, 0u);
    dspic33_device_advance(cpu, 0u);
    expect(state, dspic33_read_word(cpu, timer_registers[0]) == 0u,
           "synchronous Timer1 stops in sleep");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, timer_periods[1], 100u);
    dspic33_write_word(cpu, timer_periods[2], 0u);
    dspic33_write_word(cpu, timer_controls[2], 0x2000u);
    dspic33_write_word(cpu, timer_controls[1], 0x8008u);
    cpu->power_state = DSPIC33_POWER_IDLE;
    dspic33_device_advance(cpu, 3u);
    expect(state, dspic33_read_word(cpu, timer_registers[1]) == 0u,
           "paired high TSIDL stops timer in idle");
}

static void pmd_cases(TestState* state, Dspic33* cpu) {
    uint8_t timer;
    for (timer = 0u; timer < DSPIC33_TIMER_COUNT; timer++) {
        uint16_t pmd_address = timer < 5u ? 0x0760u : 0x0764u;
        uint16_t pmd_mask = timer < 5u ? (uint16_t)(0x0800u << timer)
                                       : (uint16_t)(0x1000u << (timer - 5u));
        dspic33_reset(cpu, 0u);
        configure_16_bit(cpu, timer, 0u, 100u, 0u);
        dspic33_write_word(cpu, pmd_address, pmd_mask);
        expect(state, cpu->io.timer_pmd_disabled == 0u,
               "timer PMD request waits one instruction cycle");
        expect(state, dspic33_device_advance(cpu, 1u), "advance timer PMD disable boundary");
        expect(state,
               cpu->io.timer_pmd_disabled == (uint16_t)(1u << timer) &&
                   dspic33_read_word(cpu, timer_controls[timer]) == 0u &&
                   dspic33_read_word(cpu, timer_registers[timer]) == 0u &&
                   dspic33_read_word(cpu, timer_periods[timer]) == 0u,
               "timer PMD disables access after boundary");
        dspic33_write_word(cpu, timer_registers[timer], 0x5555u);
        dspic33_write_word(cpu, timer_periods[timer], 0xaaaau);
        dspic33_device_advance(cpu, 3u);
        expect(state,
               stored_word(cpu, timer_registers[timer]) == 1u &&
                   stored_word(cpu, timer_periods[timer]) == 100u,
               "timer PMD blocks writes and holds counter");
        dspic33_write_word(cpu, pmd_address, 0u);
        expect(state, dspic33_device_advance(cpu, 1u), "advance timer PMD enable boundary");
        expect(state,
               cpu->io.timer_pmd_disabled == 0u &&
                   dspic33_read_word(cpu, timer_registers[timer]) == 1u,
               "timer PMD restores access without losing state");
        dspic33_device_advance(cpu, 2u);
        expect(state, dspic33_read_word(cpu, timer_registers[timer]) == 3u,
               "timer resumes after PMD enable");
    }

    dspic33_reset(cpu, 0u);
    configure_16_bit(cpu, 1u, 0u, 100u, 0x0008u);
    dspic33_write_word(cpu, 0x0760u, 0x1000u);
    dspic33_device_advance(cpu, 1u);
    dspic33_device_advance(cpu, 2u);
    expect(state,
           cpu->io.timer_pmd_disabled == 0x0002u && stored_word(cpu, timer_registers[1]) == 1u,
           "paired timer stops when low timer is PMD-disabled");

    dspic33_reset(cpu, 0u);
    configure_16_bit(cpu, 1u, 0u, 100u, 0x0008u);
    dspic33_write_word(cpu, 0x0760u, 0x2000u);
    dspic33_device_advance(cpu, 1u);
    dspic33_device_advance(cpu, 2u);
    expect(state,
           cpu->io.timer_pmd_disabled == 0x0004u && stored_word(cpu, timer_registers[1]) == 1u,
           "paired timer stops when high timer is PMD-disabled");

    dspic33_reset(cpu, 0u);
    configure_16_bit(cpu, 0u, 0u, 100u, 0u);
    dspic33_write_word(cpu, 0x0744u, 0x3800u);
    dspic33_write_word(cpu, 0x0760u, 0x0800u);
    dspic33_device_advance(cpu, 7u);
    expect(state,
           cpu->io.timer_pmd_disabled == 0u && dspic33_read_word(cpu, timer_registers[0]) == 7u,
           "DOZE scales timer PMD instruction boundary");
    dspic33_device_advance(cpu, 1u);
    expect(state, cpu->io.timer_pmd_disabled == 1u && stored_word(cpu, timer_registers[0]) == 8u,
           "timer PMD completes at divided instruction boundary");

    dspic33_reset(cpu, 0u);
    configure_16_bit(cpu, 0u, 0u, 100u, 0u);
    dspic33_write_word(cpu, 0x0760u, 0x0800u);
    dspic33_write_word(cpu, 0x0760u, 0u);
    dspic33_device_advance(cpu, 1u);
    expect(state,
           cpu->io.timer_pmd_disabled == 0u && cpu->events.count == 0u &&
               dspic33_read_word(cpu, timer_registers[0]) == 1u,
           "new timer PMD request invalidates stale transition");

    dspic33_reset(cpu, 0u);
    cpu->io.timer_pmd_generation[0] = 0x7fffu;
    dspic33_write_word(cpu, 0x0760u, 0x0800u);
    expect(state,
           dspic33_device_advance(cpu, 1u) && cpu->io.timer_pmd_generation[0] == 0x8000u &&
               cpu->io.timer_pmd_disabled == 0x0001u && cpu->events.count == 0u,
           "timer PMD disable applies across the high generation bit");
    cpu->io.timer_pmd_generation[0] = 0x7fffu;
    dspic33_write_word(cpu, 0x0760u, 0u);
    expect(state,
           dspic33_device_advance(cpu, 1u) && cpu->io.timer_pmd_generation[0] == 0x8000u &&
               cpu->io.timer_pmd_disabled == 0u && cpu->events.count == 0u,
           "timer PMD enable applies across the high generation bit");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0760u, 0x0800u);
    dspic33_device_advance(cpu, 1u);
    dspic33_write_word(cpu, 0x0760u, 0x1800u);
    dspic33_write_word(cpu, 0x0760u, 0x3800u);
    dspic33_device_advance(cpu, 1u);
    expect(state, cpu->io.timer_pmd_disabled == 0x0007u && cpu->events.count == 0u,
           "staggered timer PMD writes preserve independent transitions");

    dspic33_reset(cpu, 0u);
    configure_16_bit(cpu, 0u, 0u, 100u, 0u);
    cpu->device_cycles = UINT64_MAX;
    dspic33_write_word(cpu, 0x0760u, 0x0800u);
    expect(state,
           cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR && dspic33_read_word(cpu, 0x0760u) == 0u &&
               cpu->io.timer_pmd_disabled == 0u && cpu->events.count == 0u,
           "timer PMD scheduling failure rolls back request");
}

static void doze_interrupt_delay_cases(TestState* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_16_bit(cpu, 0u, 0u, 4u, 0u);
    expect(state, dspic33_device_advance_instruction(cpu, 1u, 8u),
           "advance divided instruction across timer match");
    expect(state, dspic33_read_word(cpu, timer_registers[0]) == 3u && !interrupt_flag(cpu, 0u),
           "timer interrupt delay uses CPU instruction domain under DOZE");
    expect(state, dspic33_device_advance_instruction(cpu, 1u, 8u),
           "advance next divided instruction");
    expect(state, interrupt_flag(cpu, 0u),
           "timer interrupt appears during following divided instruction");
}

static void timer1_write_interlock_cases(TestState* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_16_bit(cpu, 0u, 0x1234u, 0xffffu, 0x0006u);
    dspic33_write_word(cpu, timer_registers[0], 0xaaaau);
    expect(state, dspic33_read_word(cpu, timer_registers[0]) == 0x1234u,
           "synchronized running Timer1 rejects word writes");
    dspic33_write_byte(cpu, timer_registers[0], 0x55u);
    dspic33_write_byte(cpu, (uint16_t)(timer_registers[0] + 1u), 0x66u);
    expect(state, dspic33_read_word(cpu, timer_registers[0]) == 0x1234u,
           "synchronized running Timer1 rejects byte writes");

    dspic33_write_word(cpu, timer_controls[0], 0x8002u);
    dspic33_write_word(cpu, timer_registers[0], 0xbbbbu);
    expect(state, dspic33_read_word(cpu, timer_registers[0]) == 0xbbbbu,
           "asynchronous running Timer1 accepts writes");
    dspic33_write_word(cpu, timer_controls[0], 0x0006u);
    dspic33_write_word(cpu, timer_registers[0], 0xccccu);
    expect(state, dspic33_read_word(cpu, timer_registers[0]) == 0xccccu,
           "stopped synchronized Timer1 accepts writes");
}

static void dma_trigger_cases(TestState* state, Dspic33* cpu) {
    uint8_t timer;
    for (timer = 0u; timer < DSPIC33_TIMER_COUNT; timer++) {
        uint16_t source = (uint16_t)(0x2800u + timer * 2u);
        bool supported = timer >= 1u && timer <= 4u;
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, source, (uint16_t)(0x5100u + timer));
        configure_dma(cpu, timer_irqs[timer], source, TIMER_DMA_WRITE_PAD);
        configure_16_bit(cpu, timer, 0u, 1u, 0u);
        expect(state, dspic33_device_advance(cpu, 1u) && cpu->events.count != 0u,
               "advance timer period match before DMA classification");
        expect(state,
               stored_word(cpu, TIMER_DMA_WRITE_PAD) ==
                       (supported ? (uint16_t)(0x5100u + timer) : 0u) &&
                   cpu->io.dma_index[0] == 0u && ((cpu->io.dma_active & 1u) != 0u) == supported,
               supported ? "TMR2 through TMR5 period requests DMA"
                         : "unsupported timer period does not request DMA");
        expect(state, !interrupt_flag(cpu, timer), "timer DMA precedes interrupt flag");
    }
}

static void copy_cases(TestState* state, Dspic33* cpu) {
    Dspic33 copy;
    bool initialized = dspic33_initialize(&copy);
    expect(state, initialized, "initialize timer copy");
    if (!initialized) {
        return;
    }
    dspic33_reset(cpu, 0u);
    configure_16_bit(cpu, 1u, 7u, 100u, 0x0012u);
    dspic33_timer_gate(cpu, 1u, true, 4u);
    expect(state, dspic33_copy(&copy, cpu), "copy timer state");
    expect(state, copy.io.timer_enabled == cpu->io.timer_enabled, "copy timer enabled state");
    expect(state, copy.io.timer_fraction[1] == cpu->io.timer_fraction[1],
           "copy timer prescaler state");
    expect(state, copy.events.count == cpu->events.count, "copy timer events");

    dspic33_reset(cpu, 0u);
    configure_16_bit(cpu, 0u, 0u, 10u, 0u);
    dspic33_device_advance(cpu, 10u);
    dspic33_write_word(cpu, 0x0760u, 0x0800u);
    expect(state, dspic33_copy(&copy, cpu), "copy timer interrupt and PMD deadlines");
    expect(state,
           dspic33_device_advance(cpu, 1u) && dspic33_device_advance(&copy, 1u) &&
               interrupt_flag(cpu, 0u) && interrupt_flag(&copy, 0u) &&
               cpu->io.timer_pmd_disabled == 1u && copy.io.timer_pmd_disabled == 1u,
           "timer copy preserves independent deadlines");

    dspic33_reset(cpu, 0u);
    configure_16_bit(cpu, 0u, 0u, 100u, 0u);
    dspic33_write_word(cpu, 0x0760u, 0x0800u);
    dspic33_load_program_word(cpu, 0u, RESET_OPCODE);
    cpu->pc = 0u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && dspic33_read_word(cpu, 0x0760u) == 0u &&
               cpu->io.timer_pmd_disabled == 0u && cpu->events.count == 0u,
           "warm reset cancels timer PMD transition");

    dspic33_reset(cpu, 0u);
    configure_16_bit(cpu, 0u, 0u, 10u, 0u);
    dspic33_device_advance(cpu, 10u);
    dspic33_load_program_word(cpu, 0u, RESET_OPCODE);
    cpu->pc = 0u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && !interrupt_flag(cpu, 0u) &&
               cpu->events.count == 0u,
           "warm reset cancels pending timer interrupt");
    dspic33_release(&copy);
}

