tylertms/dspic33e-sim/tests/device/dspic33ep_mu/timing/timer_test.c
static void api_failure_cases(TestState* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    expect(state,
           !dspic33_timer_pulse(cpu, DSPIC33_TIMER_COUNT, 1u, 0u) &&
               !dspic33_timer_pulse(cpu, 0u, 0u, 0u) &&
               !dspic33_timer_gate(cpu, DSPIC33_TIMER_COUNT, true, 0u),
           "timer APIs reject invalid requests");
    cpu->device_cycles = UINT64_MAX;
    expect(state,
           !dspic33_timer_pulse(cpu, 0u, 1u, 1u) && !dspic33_timer_gate(cpu, 0u, true, 1u) &&
               cpu->events.count == 0u,
           "timer APIs reject overflowing deadlines");
}

int main(void) {
    TestState state = {0u, 0u, 0u};
    Dspic33 cpu;
    bool initialized = dspic33_initialize(&cpu);
    expect(&state, initialized, "initialize timer processor");
    if (initialized) {
        register_cases(&state, &cpu);
        internal_counting_cases(&state, &cpu);
        prescaler_cases(&state, &cpu);
        boundary_cases(&state, &cpu);
        interrupt_delay_cases(&state, &cpu);
        prescaler_reset_cases(&state, &cpu);
        gate_cases(&state, &cpu);
        external_clock_cases(&state, &cpu);
        delayed_event_cases(&state, &cpu);
        pps_input_cases(&state, &cpu);
        timer1_pin_cases(&state, &cpu);
        pps_event_cases(&state, &cpu);
        paired_timer_cases(&state, &cpu);
        paired_mode_cases(&state, &cpu);
        power_mode_cases(&state, &cpu);
        pmd_cases(&state, &cpu);
        doze_interrupt_delay_cases(&state, &cpu);
        timer1_write_interlock_cases(&state, &cpu);
        dma_trigger_cases(&state, &cpu);
        copy_cases(&state, &cpu);
        api_failure_cases(&state, &cpu);
        dspic33_release(&cpu);
    }
    return test_finish(&state);
}
